---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalNodeData.GetConnectionStatus
source: html/a72af2d3-764d-5981-8420-4614dc9720ff.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalNodeData.GetConnectionStatus Method

Returns the Connection Status for this Analytical Node.

## Syntax (C#)
```csharp
public AnalyticalNodeConnectionStatus GetConnectionStatus()
```